challenge-16/tests/performance/result_nobloq.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 10:15:39(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:15:40(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 10:15:42(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 250/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 47
  median: ...................................................................... 15
  p95: ......................................................................... 25.8
  p99: ......................................................................... 36.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 405.2
  max: ......................................................................... 999.9
  median: ...................................................................... 854.2
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1002.4